import random
import colorama
from colorama import Fore
colorama.init(autoreset=True)

def ban():
    a= (Fore.CYAN+''' 
▀█▀ █▀▀▄ █▀▀ ▀▀█▀▀ █▀▀█ 　 ░█─── █▀▀█ █▀▀█ █▀▀▄ █▀▀ █▀▀█ 
░█─ █──█ ▀▀█ ──█── █▄▄█ 　 ░█─── █──█ █▄▄█ █──█ █▀▀ █▄▄▀ 
▄█▄ ▀──▀ ▀▀▀ ──▀── ▀──▀ 　 ░█▄▄█ ▀▀▀▀ ▀──▀ ▀▀▀─ ▀▀▀ ▀─▀▀    ╍●‿●╍ 
----------------------------------------------------
                                         v-2.0
    instagram - https://www.instgram.com/im.raj.569
    github - https://github.com/imraj569
----------------------------------------------------
    ''')
    b = (Fore.RED+'''
╭━━╮╱╱╭━┳╮╱╱╱╱╭╮╱╱╱╱╱╱╭╮
╰┃┃╋━┳┫━┫╰┳━╮╱┃┃╭━┳━╮╭╯┣━┳┳╮
╭┃┃┫┃┃┣━┃╭┫╋╰╮┃╰┫╋┃╋╰┫╋┃┻┫╭╯
╰━━┻┻━┻━┻━┻━━╯╰━┻━┻━━┻━┻━┻╯ ʕ•́ᴥ•̀ʔっ
---------------------------------------------------
                                        v-2.0
    instagram - https://www.instgram.com/im.raj.569
    github - https://github.com/imraj569
----------------------------------------------------
    ''')

    c = (Fore.BLUE+'''
    █ █▄░█ █▀ ▀█▀ ▄▀█   █░░ █▀█ ▄▀█ █▀▄ █▀▀ █▀█
    █ █░▀█ ▄█ ░█░ █▀█   █▄▄ █▄█ █▀█ █▄▀ ██▄ █▀▄     ≧◠‿◠≦✌
------------------------------------------------------
                                            v-2.0
    instagram - https://www.instgram.com/im.raj.569
    github - https://github.com/imraj569
------------------------------------------------------    ''')

    x = [a,b,c]
    xx = random.choice(x)
    print(xx)

def bye():
    print(Fore.CYAN+'''
    𝕓𝕪𝕖 ☃ thanks for using instaloader ʕ•́ᴥ•̀ʔっ
    ''')